results_mongodb/workloadB/run1
/usr/bin/java  -classpath /home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/conf:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/db-benchmarking-log8430e/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p mongodb.url=mongodb://127.0.0.1:27017/ycsb?w=1
mongo client connection created with mongodb://127.0.0.1:27017/ycsb?w=1
[OVERALL], RunTime(ms), 1952
[OVERALL], Throughput(ops/sec), 512.2950819672132
[TOTAL_GCS_G1_Young_Generation], Count, 4
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 42
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.151639344262295
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 4
[TOTAL_GC_TIME], Time(ms), 42
[TOTAL_GC_TIME_%], Time(%), 2.151639344262295
[READ], Operations, 953
[READ], AverageLatency(us), 1089.3105981112276
[READ], MinLatency(us), 524
[READ], MaxLatency(us), 136959
[READ], 95thPercentileLatency(us), 1941
[READ], 99thPercentileLatency(us), 4955
[READ], Return=OK, 953
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3797.0
[CLEANUP], MinLatency(us), 3796
[CLEANUP], MaxLatency(us), 3797
[CLEANUP], 95thPercentileLatency(us), 3797
[CLEANUP], 99thPercentileLatency(us), 3797
[UPDATE], Operations, 47
[UPDATE], AverageLatency(us), 4453.255319148936
[UPDATE], MinLatency(us), 815
[UPDATE], MaxLatency(us), 15599
[UPDATE], 95thPercentileLatency(us), 7803
[UPDATE], 99thPercentileLatency(us), 15599
[UPDATE], Return=OK, 47